tap "mas-cli/tap"
tap "homebrew/cask-versions"
tap "fabianishere/personal"
tap "rajiv/fastmate"

brew "mas"

# Dev tools
cask "google-cloud-sdk"
cask "docker"

# Languages
brew "python"
brew "go"
brew "rustup-init"
brew "node"
# brew "elixir"
# brew "clojure-lsp"
# brew "clojure"
# brew "leiningen"

# Dev tools
brew "openssl"
brew "ffmpeg"
cask "gpg-suite"
brew "coreutils"
brew "tmux"
brew "bash"
brew "neovim"
brew "wget"
brew "watch"
brew "readline"
brew "z"
brew "ag"
brew "ack"
brew "fzf"
brew "gnu-sed"
brew "git"
brew "direnv"
brew "gh"
brew "reattach-to-user-namespace"
brew "pam_reattach"
brew "rclone"

brew "unison"
# brew "mackup"
brew "fish", args: ['head']
brew "starship"
brew "autozimu/homebrew-formulas/unison-fsmonitor"


# Dev Apps
cask "little-snitch"
cask "alacritty"
cask "kitty"
cask "sublime-text"
cask "sublime-merge"
cask "dash"
cask "hazel"
cask "visual-studio-code"
cask "jetbrains-toolbox"

# Automation // Productivity
cask "keyboard-maestro"
cask "alfred"
# cask "alt-tab"
# cask "rectangle"
cask "raycast"
cask "macupdater"
cask "textsniper"

# General Apps
mas "Slack", id: 803453959
cask "discord"
cask "transmission"
cask "firefox-developer-edition"
cask "brave-browser"
cask "vivaldi"
cask "choosy"
cask "1password"
cask "bartender"
# cask "beamer"
cask "iina"
cask "fastmate"
cask "sensei"
cask "obsidian"
cask "pastebot"
cask "soundsource"
mas "Tailscale", id: 1475387142
cask "syncthing"
cask "launchcontrol"
cask "typora"
cask "arq"
cask "downie"
# cask "rocket"

mas "The Unarchiver", id: 425424353
mas "Pixelmator Pro", id: 1289583905
mas "Day One", id: 1055511498
mas "LINE", id: 539883307
mas "Reeder", id: 1529448980
mas "Things 3", id: 904280696
mas "Fantastical", id: 975937182
mas "DaisyDisk", id: 411643860
mas "iMazing HEIC Converter", id: 1292198261
mas "NotePlan 3", id: 1505432629
mas "Anybox", id: 1593408455
cask "imazing"

mas "StopTheMadness", id: 1376402589
mas "1Blocker", id: 1365531024

mas "Numbers", id: 409203825
mas "Keynote", id: 409183694
mas "Pages", id: 409201541
mas "Drafts", id: 1435957248
mas "iA Writer", id: 775737590
cask "airbuddy"

mas "Notability", id: 736189492
mas "GoodNotes", id: 1444383602
